Revit 2026 API

# IFrameworkElementCreator Methods

---

The IFrameworkElementCreator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateFrameworkElement | Method called to create the FrameworkElement. |

#### Reference

IFrameworkElementCreator Interface

Autodesk.Revit.UI Namespace